"Error: unable to download updates." = "Error: Unable to download the update.";
"Error: the downloaded file is corrupt." = "Error: Downloaded file is corrupt.";
"Error: unable to open the downloaded file. Please try again." = "Error: Unable to open the downloaded file. Please try again.";
"Error: %@ %@" = "Error: %@ %@";
"Download completes. Do you want to install it now?" = "Finshed downloading. Do you want to install it now?";
"Downloading...%d %%" = "Downloading...%d %%";
"Downloading... %ju KB" = "Downloading... %ju KB";
"A newer version is available." = "A new version is available.";
"Do you want to download it right now?" = "Do you want to download it now?";
"Yes" = "Yes";
"No" = "No";
"Please download the newest version." = "Please download the newest version.";